Autodesk.Revit.DB.SchemaDownloadResult.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SchemaDownloadResult.#ctor(System.String)
Indicates that the given schema was downloaded successfully.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.SchemaDownloadResult.#ctor(Autodesk.Revit.DB.ParameterDownloadStatus)
Indicates an unsuccessful download.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.SchemaDownloadResult
Indicates the result of an attempt to download a schema.